GopalSaraf/Practicals/PSDL/include/proc/pic12f635.inc
// Register: OSCTUNE
#define OSCTUNE OSCTUNE
OSCTUNE                                  equ 0090h
// bitfield definitions
OSCTUNE_TUN_POSN                         equ 0000h
OSCTUNE_TUN_POSITION                     equ 0000h
OSCTUNE_TUN_SIZE                         equ 0005h
OSCTUNE_TUN_LENGTH                       equ 0005h
OSCTUNE_TUN_MASK                         equ 001Fh
OSCTUNE_TUN0_POSN                        equ 0000h
OSCTUNE_TUN0_POSITION                    equ 0000h
OSCTUNE_TUN0_SIZE                        equ 0001h
OSCTUNE_TUN0_LENGTH                      equ 0001h
OSCTUNE_TUN0_MASK                        equ 0001h
OSCTUNE_TUN1_POSN                        equ 0001h
OSCTUNE_TUN1_POSITION                    equ 0001h
OSCTUNE_TUN1_SIZE                        equ 0001h
OSCTUNE_TUN1_LENGTH                      equ 0001h
OSCTUNE_TUN1_MASK                        equ 0002h
OSCTUNE_TUN2_POSN                        equ 0002h
OSCTUNE_TUN2_POSITION                    equ 0002h
OSCTUNE_TUN2_SIZE                        equ 0001h
OSCTUNE_TUN2_LENGTH                      equ 0001h
OSCTUNE_TUN2_MASK                        equ 0004h
OSCTUNE_TUN3_POSN                        equ 0003h
OSCTUNE_TUN3_POSITION                    equ 0003h
OSCTUNE_TUN3_SIZE                        equ 0001h
OSCTUNE_TUN3_LENGTH                      equ 0001h
OSCTUNE_TUN3_MASK                        equ 0008h
OSCTUNE_TUN4_POSN                        equ 0004h
OSCTUNE_TUN4_POSITION                    equ 0004h
OSCTUNE_TUN4_SIZE                        equ 0001h
OSCTUNE_TUN4_LENGTH                      equ 0001h
OSCTUNE_TUN4_MASK                        equ 0010h

// Register: LVDCON
#define LVDCON LVDCON
LVDCON                                   equ 0094h
// bitfield definitions
LVDCON_LVDL_POSN                         equ 0000h
LVDCON_LVDL_POSITION                     equ 0000h
LVDCON_LVDL_SIZE                         equ 0003h
LVDCON_LVDL_LENGTH                       equ 0003h
LVDCON_LVDL_MASK                         equ 0007h
LVDCON_LVDEN_POSN                        equ 0004h
LVDCON_LVDEN_POSITION                    equ 0004h
LVDCON_LVDEN_SIZE                        equ 0001h
LVDCON_LVDEN_LENGTH                      equ 0001h
LVDCON_LVDEN_MASK                        equ 0010h
LVDCON_IRVST_POSN                        equ 0005h
LVDCON_IRVST_POSITION                    equ 0005h
LVDCON_IRVST_SIZE                        equ 0001h
LVDCON_IRVST_LENGTH                      equ 0001h
LVDCON_IRVST_MASK                        equ 0020h
LVDCON_LVDL0_POSN                        equ 0000h
LVDCON_LVDL0_POSITION                    equ 0000h
LVDCON_LVDL0_SIZE                        equ 0001h
LVDCON_LVDL0_LENGTH                      equ 0001h
LVDCON_LVDL0_MASK                        equ 0001h
LVDCON_LVDL1_POSN                        equ 0001h
LVDCON_LVDL1_POSITION                    equ 0001h
LVDCON_LVDL1_SIZE                        equ 0001h
LVDCON_LVDL1_LENGTH                      equ 0001h
LVDCON_LVDL1_MASK                        equ 0002h
LVDCON_LVDL2_POSN                        equ 0002h
LVDCON_LVDL2_POSITION                    equ 0002h
LVDCON_LVDL2_SIZE                        equ 0001h
LVDCON_LVDL2_LENGTH                      equ 0001h
LVDCON_LVDL2_MASK                        equ 0004h
LVDCON_PLVDEN_POSN                       equ 0004h
LVDCON_PLVDEN_POSITION                   equ 0004h
LVDCON_PLVDEN_SIZE                       equ 0001h
LVDCON_PLVDEN_LENGTH                     equ 0001h
LVDCON_PLVDEN_MASK                       equ 0010h

// Register: WPUDA
#define WPUDA WPUDA
WPUDA                                    equ 0095h
// bitfield definitions
WPUDA_WPUDA0_POSN                        equ 0000h
WPUDA_WPUDA0_POSITION                    equ 0000h
WPUDA_WPUDA0_SIZE                        equ 0001h
WPUDA_WPUDA0_LENGTH                      equ 0001h
WPUDA_WPUDA0_MASK                        equ 0001h
WPUDA_WPUDA1_POSN                        equ 0001h
WPUDA_WPUDA1_POSITION                    equ 0001h
WPUDA_WPUDA1_SIZE                        equ 0001h
WPUDA_WPUDA1_LENGTH                      equ 0001h
WPUDA_WPUDA1_MASK                        equ 0002h
WPUDA_WPUDA2_POSN                        equ 0002h
WPUDA_WPUDA2_POSITION                    equ 0002h
WPUDA_WPUDA2_SIZE                        equ 0001h
WPUDA_WPUDA2_LENGTH                      equ 0001h
WPUDA_WPUDA2_MASK                        equ 0004h
WPUDA_WPUDA4_POSN                        equ 0004h
WPUDA_WPUDA4_POSITION                    equ 0004h
WPUDA_WPUDA4_SIZE                        equ 0001h
WPUDA_WPUDA4_LENGTH                      equ 0001h
WPUDA_WPUDA4_MASK                        equ 0010h
WPUDA_WPUDA5_POSN                        equ 0005h
WPUDA_WPUDA5_POSITION                    equ 0005h
WPUDA_WPUDA5_SIZE                        equ 0001h
WPUDA_WPUDA5_LENGTH                      equ 0001h
WPUDA_WPUDA5_MASK                        equ 0020h

// Register: IOCA
#define IOCA IOCA
IOCA                                     equ 0096h
// bitfield definitions
IOCA_IOCA0_POSN                          equ 0000h
IOCA_IOCA0_POSITION                      equ 0000h
IOCA_IOCA0_SIZE                          equ 0001h
IOCA_IOCA0_LENGTH                        equ 0001h
IOCA_IOCA0_MASK                          equ 0001h
IOCA_IOCA1_POSN                          equ 0001h
IOCA_IOCA1_POSITION                      equ 0001h
IOCA_IOCA1_SIZE                          equ 0001h
IOCA_IOCA1_LENGTH                        equ 0001h
IOCA_IOCA1_MASK                          equ 0002h
IOCA_IOCA2_POSN                          equ 0002h
IOCA_IOCA2_POSITION                      equ 0002h
IOCA_IOCA2_SIZE                          equ 0001h
IOCA_IOCA2_LENGTH                        equ 0001h
IOCA_IOCA2_MASK                          equ 0004h
IOCA_IOCA3_POSN                          equ 0003h
IOCA_IOCA3_POSITION                      equ 0003h
IOCA_IOCA3_SIZE                          equ 0001h
IOCA_IOCA3_LENGTH                        equ 0001h
IOCA_IOCA3_MASK                          equ 0008h
IOCA_IOCA4_POSN                          equ 0004h
IOCA_IOCA4_POSITION                      equ 0004h
IOCA_IOCA4_SIZE                          equ 0001h
IOCA_IOCA4_LENGTH                        equ 0001h
IOCA_IOCA4_MASK                          equ 0010h
IOCA_IOCA5_POSN                          equ 0005h
IOCA_IOCA5_POSITION                      equ 0005h
IOCA_IOCA5_SIZE                          equ 0001h
IOCA_IOCA5_LENGTH                        equ 0001h
IOCA_IOCA5_MASK                          equ 0020h

// Register: WDA
#define WDA WDA
WDA                                      equ 0097h
// bitfield definitions
WDA_WDA0_POSN                            equ 0000h
WDA_WDA0_POSITION                        equ 0000h
WDA_WDA0_SIZE                            equ 0001h
WDA_WDA0_LENGTH                          equ 0001h
WDA_WDA0_MASK                            equ 0001h
WDA_WDA1_POSN                            equ 0001h
WDA_WDA1_POSITION                        equ 0001h
WDA_WDA1_SIZE                            equ 0001h
WDA_WDA1_LENGTH                          equ 0001h
WDA_WDA1_MASK                            equ 0002h
WDA_WDA2_POSN                            equ 0002h
WDA_WDA2_POSITION                        equ 0002h
WDA_WDA2_SIZE                            equ 0001h
WDA_WDA2_LENGTH                          equ 0001h
WDA_WDA2_MASK                            equ 0004h
WDA_WDA4_POSN                            equ 0004h
WDA_WDA4_POSITION                        equ 0004h
WDA_WDA4_SIZE                            equ 0001h
WDA_WDA4_LENGTH                          equ 0001h
WDA_WDA4_MASK                            equ 0010h
WDA_WDA5_POSN                            equ 0005h
WDA_WDA5_POSITION                        equ 0005h
WDA_WDA5_SIZE                            equ 0001h
WDA_WDA5_LENGTH                          equ 0001h
WDA_WDA5_MASK                            equ 0020h

// Register: VRCON
#define VRCON VRCON
VRCON                                    equ 0099h
// bitfield definitions
VRCON_VR_POSN                            equ 0000h
VRCON_VR_POSITION                        equ 0000h
VRCON_VR_SIZE                            equ 0004h
VRCON_VR_LENGTH                          equ 0004h
VRCON_VR_MASK                            equ 000Fh
VRCON_VRR_POSN                           equ 0005h
VRCON_VRR_POSITION                       equ 0005h
VRCON_VRR_SIZE                           equ 0001h
VRCON_VRR_LENGTH                         equ 0001h
VRCON_VRR_MASK                           equ 0020h
VRCON_VREN_POSN                          equ 0007h
VRCON_VREN_POSITION                      equ 0007h
VRCON_VREN_SIZE                          equ 0001h
VRCON_VREN_LENGTH                        equ 0001h
VRCON_VREN_MASK                          equ 0080h
VRCON_VR0_POSN                           equ 0000h
VRCON_VR0_POSITION                       equ 0000h
VRCON_VR0_SIZE                           equ 0001h
VRCON_VR0_LENGTH                         equ 0001h
VRCON_VR0_MASK                           equ 0001h
VRCON_VR1_POSN                           equ 0001h
VRCON_VR1_POSITION                       equ 0001h
VRCON_VR1_SIZE                           equ 0001h
VRCON_VR1_LENGTH                         equ 0001h
VRCON_VR1_MASK                           equ 0002h
VRCON_VR2_POSN                           equ 0002h
VRCON_VR2_POSITION                       equ 0002h
VRCON_VR2_SIZE                           equ 0001h
VRCON_VR2_LENGTH                         equ 0001h
VRCON_VR2_MASK                           equ 0004h
VRCON_VR3_POSN                           equ 0003h
VRCON_VR3_POSITION                       equ 0003h
VRCON_VR3_SIZE                           equ 0001h
VRCON_VR3_LENGTH                         equ 0001h
VRCON_VR3_MASK                           equ 0008h

