GopalSaraf/Practicals/PSDL/include/proc/pic12f635.inc
// Register: EEDAT
#define EEDAT EEDAT
EEDAT                                    equ 009Ah
// bitfield definitions
EEDAT_EEDAT_POSN                         equ 0000h
EEDAT_EEDAT_POSITION                     equ 0000h
EEDAT_EEDAT_SIZE                         equ 0008h
EEDAT_EEDAT_LENGTH                       equ 0008h
EEDAT_EEDAT_MASK                         equ 00FFh

// Register: EEADR
#define EEADR EEADR
EEADR                                    equ 009Bh

// Register: EECON1
#define EECON1 EECON1
EECON1                                   equ 009Ch
// bitfield definitions
EECON1_RD_POSN                           equ 0000h
EECON1_RD_POSITION                       equ 0000h
EECON1_RD_SIZE                           equ 0001h
EECON1_RD_LENGTH                         equ 0001h
EECON1_RD_MASK                           equ 0001h
EECON1_WR_POSN                           equ 0001h
EECON1_WR_POSITION                       equ 0001h
EECON1_WR_SIZE                           equ 0001h
EECON1_WR_LENGTH                         equ 0001h
EECON1_WR_MASK                           equ 0002h
EECON1_WREN_POSN                         equ 0002h
EECON1_WREN_POSITION                     equ 0002h
EECON1_WREN_SIZE                         equ 0001h
EECON1_WREN_LENGTH                       equ 0001h
EECON1_WREN_MASK                         equ 0004h
EECON1_WRERR_POSN                        equ 0003h
EECON1_WRERR_POSITION                    equ 0003h
EECON1_WRERR_SIZE                        equ 0001h
EECON1_WRERR_LENGTH                      equ 0001h
EECON1_WRERR_MASK                        equ 0008h

// Register: EECON2
#define EECON2 EECON2
EECON2                                   equ 009Dh

// Register: CRCON
#define CRCON CRCON
CRCON                                    equ 0110h
// bitfield definitions
CRCON_CRREG_POSN                         equ 0000h
CRCON_CRREG_POSITION                     equ 0000h
CRCON_CRREG_SIZE                         equ 0002h
CRCON_CRREG_LENGTH                       equ 0002h
CRCON_CRREG_MASK                         equ 0003h
CRCON_ENC_nDEC_POSN                      equ 0006h
CRCON_ENC_nDEC_POSITION                  equ 0006h
CRCON_ENC_nDEC_SIZE                      equ 0001h
CRCON_ENC_nDEC_LENGTH                    equ 0001h
CRCON_ENC_nDEC_MASK                      equ 0040h
CRCON_GO_nDONE_POSN                      equ 0007h
CRCON_GO_nDONE_POSITION                  equ 0007h
CRCON_GO_nDONE_SIZE                      equ 0001h
CRCON_GO_nDONE_LENGTH                    equ 0001h
CRCON_GO_nDONE_MASK                      equ 0080h
CRCON_CRREG0_POSN                        equ 0000h
CRCON_CRREG0_POSITION                    equ 0000h
CRCON_CRREG0_SIZE                        equ 0001h
CRCON_CRREG0_LENGTH                      equ 0001h
CRCON_CRREG0_MASK                        equ 0001h
CRCON_CRREG1_POSN                        equ 0001h
CRCON_CRREG1_POSITION                    equ 0001h
CRCON_CRREG1_SIZE                        equ 0001h
CRCON_CRREG1_LENGTH                      equ 0001h
CRCON_CRREG1_MASK                        equ 0002h
CRCON_ENC_DEC_POSN                       equ 0006h
CRCON_ENC_DEC_POSITION                   equ 0006h
CRCON_ENC_DEC_SIZE                       equ 0001h
CRCON_ENC_DEC_LENGTH                     equ 0001h
CRCON_ENC_DEC_MASK                       equ 0040h
CRCON_GO_POSN                            equ 0007h
CRCON_GO_POSITION                        equ 0007h
CRCON_GO_SIZE                            equ 0001h
CRCON_GO_LENGTH                          equ 0001h
CRCON_GO_MASK                            equ 0080h

// Register: CRDAT0
#define CRDAT0 CRDAT0
CRDAT0                                   equ 0111h
// bitfield definitions
CRDAT0_CRDAT0_POSN                       equ 0000h
CRDAT0_CRDAT0_POSITION                   equ 0000h
CRDAT0_CRDAT0_SIZE                       equ 0008h
CRDAT0_CRDAT0_LENGTH                     equ 0008h
CRDAT0_CRDAT0_MASK                       equ 00FFh

// Register: CRDAT1
#define CRDAT1 CRDAT1
CRDAT1                                   equ 0112h
// bitfield definitions
CRDAT1_CRDAT1_POSN                       equ 0000h
CRDAT1_CRDAT1_POSITION                   equ 0000h
CRDAT1_CRDAT1_SIZE                       equ 0008h
CRDAT1_CRDAT1_LENGTH                     equ 0008h
CRDAT1_CRDAT1_MASK                       equ 00FFh

// Register: CRDAT2
#define CRDAT2 CRDAT2
CRDAT2                                   equ 0113h
// bitfield definitions
CRDAT2_CRDAT2_POSN                       equ 0000h
CRDAT2_CRDAT2_POSITION                   equ 0000h
CRDAT2_CRDAT2_SIZE                       equ 0008h
CRDAT2_CRDAT2_LENGTH                     equ 0008h
CRDAT2_CRDAT2_MASK                       equ 00FFh

// Register: CRDAT3
#define CRDAT3 CRDAT3
CRDAT3                                   equ 0114h
// bitfield definitions
CRDAT3_CRDAT3_POSN                       equ 0000h
CRDAT3_CRDAT3_POSITION                   equ 0000h
CRDAT3_CRDAT3_SIZE                       equ 0008h
CRDAT3_CRDAT3_LENGTH                     equ 0008h
CRDAT3_CRDAT3_MASK                       equ 00FFh

/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 07FFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 07Fh)
#endif
#define C1IE                             BANKMASK(PIE1), 3
#define C1IF                             BANKMASK(PIR1), 3
#define C1INV                            BANKMASK(CMCON0), 4
#define C1OUT                            BANKMASK(CMCON0), 6
#define C1SYNC                           BANKMASK(CMCON1), 0
#define CARRY                            BANKMASK(STATUS), 0
#define CINV                             BANKMASK(CMCON0), 4
#define CIS                              BANKMASK(CMCON0), 3
#define CM0                              BANKMASK(CMCON0), 0
#define CM1                              BANKMASK(CMCON0), 1
#define CM2                              BANKMASK(CMCON0), 2
#define CMSYNC                           BANKMASK(CMCON1), 0
#define COUT                             BANKMASK(CMCON0), 6
#define CRIE                             BANKMASK(PIE1), 5
#define CRIF                             BANKMASK(PIR1), 5
#define CRREG0                           BANKMASK(CRCON), 0
#define CRREG1                           BANKMASK(CRCON), 1
#define DC                               BANKMASK(STATUS), 1
#define EEIE                             BANKMASK(PIE1), 7
#define EEIF                             BANKMASK(PIR1), 7
#define ENC_DEC                          BANKMASK(CRCON), 6
#define ENC_nDEC                         BANKMASK(CRCON), 6
#define GIE                              BANKMASK(INTCON), 7
#define GO                               BANKMASK(CRCON), 7
#define GO_nDONE                         BANKMASK(CRCON), 7
#define GP0                              BANKMASK(GPIO), 0
#define GP1                              BANKMASK(GPIO), 1
#define GP2                              BANKMASK(GPIO), 2
#define GP3                              BANKMASK(GPIO), 3
#define GP4                              BANKMASK(GPIO), 4
#define GP5                              BANKMASK(GPIO), 5
#define HTS                              BANKMASK(OSCCON), 2
#define INTE                             BANKMASK(INTCON), 4
#define INTEDG                           BANKMASK(OPTION_REG), 6
#define INTF                             BANKMASK(INTCON), 1
#define IOCA0                            BANKMASK(IOCA), 0
#define IOCA1                            BANKMASK(IOCA), 1
#define IOCA2                            BANKMASK(IOCA), 2
#define IOCA3                            BANKMASK(IOCA), 3
#define IOCA4                            BANKMASK(IOCA), 4
#define IOCA5                            BANKMASK(IOCA), 5
#define IRCF0                            BANKMASK(OSCCON), 4
#define IRCF1                            BANKMASK(OSCCON), 5
#define IRCF2                            BANKMASK(OSCCON), 6
#define IRVST                            BANKMASK(LVDCON), 5
#define LTS                              BANKMASK(OSCCON), 1
#define LVDEN                            BANKMASK(LVDCON), 4
#define LVDIE                            BANKMASK(PIE1), 6
#define LVDIF                            BANKMASK(PIR1), 6
#define LVDL0                            BANKMASK(LVDCON), 0
#define LVDL1                            BANKMASK(LVDCON), 1
#define LVDL2                            BANKMASK(LVDCON), 2
#define OSFIE                            BANKMASK(PIE1), 2
#define OSFIF                            BANKMASK(PIR1), 2
#define OSTS                             BANKMASK(OSCCON), 3
#define PEIE                             BANKMASK(INTCON), 6
#define PLVDEN                           BANKMASK(LVDCON), 4
#define PS0                              BANKMASK(OPTION_REG), 0
#define PS1                              BANKMASK(OPTION_REG), 1
#define PS2                              BANKMASK(OPTION_REG), 2
#define PSA                              BANKMASK(OPTION_REG), 3
#define RA0                              BANKMASK(GPIO), 0
#define RA1                              BANKMASK(GPIO), 1
#define RA2                              BANKMASK(GPIO), 2
#define RA3                              BANKMASK(GPIO), 3
#define RA4                              BANKMASK(GPIO), 4
#define RA5                              BANKMASK(GPIO), 5
#define RAIE                             BANKMASK(INTCON), 3
#define RAIF                             BANKMASK(INTCON), 0
#define RD                               BANKMASK(EECON1), 0
#define RP0                              BANKMASK(STATUS), 5
#define RP1                              BANKMASK(STATUS), 6
#define SBODEN                           BANKMASK(PCON), 4
#define SBOREN                           BANKMASK(PCON), 4
#define SCS                              BANKMASK(OSCCON), 0
#define SWDTEN                           BANKMASK(WDTCON), 0
#define T0CS                             BANKMASK(OPTION_REG), 5
#define T0IE                             BANKMASK(INTCON), 5
#define T0IF                             BANKMASK(INTCON), 2
#define T0SE                             BANKMASK(OPTION_REG), 4
#define T1CKPS0                          BANKMASK(T1CON), 4
#define T1CKPS1                          BANKMASK(T1CON), 5
#define T1GINV                           BANKMASK(T1CON), 7
#define T1GSS                            BANKMASK(CMCON1), 1
#define T1OSCEN                          BANKMASK(T1CON), 3
#define TMR1CS                           BANKMASK(T1CON), 1
#define TMR1GE                           BANKMASK(T1CON), 6
#define TMR1IE                           BANKMASK(PIE1), 0
#define TMR1IF                           BANKMASK(PIR1), 0
#define TMR1ON                           BANKMASK(T1CON), 0
#define TRISA0                           BANKMASK(TRISIO), 0
#define TRISA1                           BANKMASK(TRISIO), 1
#define TRISA2                           BANKMASK(TRISIO), 2
#define TRISA3                           BANKMASK(TRISIO), 3
#define TRISA4                           BANKMASK(TRISIO), 4
#define TRISA5                           BANKMASK(TRISIO), 5
#define TRISIO0                          BANKMASK(TRISIO), 0
#define TRISIO1                          BANKMASK(TRISIO), 1
#define TRISIO2                          BANKMASK(TRISIO), 2
#define TRISIO3                          BANKMASK(TRISIO), 3
#define TRISIO4                          BANKMASK(TRISIO), 4
#define TRISIO5                          BANKMASK(TRISIO), 5
#define TUN0                             BANKMASK(OSCTUNE), 0
#define TUN1                             BANKMASK(OSCTUNE), 1
#define TUN2                             BANKMASK(OSCTUNE), 2
#define TUN3                             BANKMASK(OSCTUNE), 3
#define TUN4                             BANKMASK(OSCTUNE), 4
#define ULPWUE                           BANKMASK(PCON), 5
#define VR0                              BANKMASK(VRCON), 0
#define VR1                              BANKMASK(VRCON), 1
#define VR2                              BANKMASK(VRCON), 2
#define VR3                              BANKMASK(VRCON), 3
#define VREN                             BANKMASK(VRCON), 7
#define VRR                              BANKMASK(VRCON), 5
#define WDA0                             BANKMASK(WDA), 0
#define WDA1                             BANKMASK(WDA), 1
#define WDA2                             BANKMASK(WDA), 2
#define WDA4                             BANKMASK(WDA), 4
#define WDA5                             BANKMASK(WDA), 5
#define WDTPS0                           BANKMASK(WDTCON), 1
#define WDTPS1                           BANKMASK(WDTCON), 2
#define WDTPS2                           BANKMASK(WDTCON), 3
#define WDTPS3                           BANKMASK(WDTCON), 4
#define WPUDA0                           BANKMASK(WPUDA), 0
#define WPUDA1                           BANKMASK(WPUDA), 1
#define WPUDA2                           BANKMASK(WPUDA), 2
#define WPUDA4                           BANKMASK(WPUDA), 4
#define WPUDA5                           BANKMASK(WPUDA), 5
#define WR                               BANKMASK(EECON1), 1
#define WREN                             BANKMASK(EECON1), 2
#define WRERR                            BANKMASK(EECON1), 3
#define ZERO                             BANKMASK(STATUS), 2
#define nBOD                             BANKMASK(PCON), 0
#define nBOR                             BANKMASK(PCON), 0
#define nPD                              BANKMASK(STATUS), 3
#define nPOR                             BANKMASK(PCON), 1
#define nRAPU                            BANKMASK(OPTION_REG), 7
#define nT1SYNC                          BANKMASK(T1CON), 2
#define nTO                              BANKMASK(STATUS), 4
#define nWUR                             BANKMASK(PCON), 3

/*
 * Device Psects
 */

#ifdef _XC_INC_

// Memory Spaces
#define SPACE_CODE   0
#define SPACE_DATA   1
#define SPACE_EEPROM 3

psect udata_shr,class=COMMON,space=SPACE_DATA,noexec
psect udata,class=RAM,space=SPACE_DATA,noexec
psect udata_bank0,class=BANK0,space=SPACE_DATA,noexec
psect code,class=CODE,space=SPACE_CODE,delta=2
psect data,class=STRCODE,space=SPACE_CODE,delta=2,noexec
psect edata,class=EEDATA,space=SPACE_EEPROM,delta=2,noexec

#endif // _XC_INC_

#endif // _PIC12F635_INC_
